Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །མཐོང་ནས་བདག་སེམས་དད་བྱས་ཏེ།
en: Having seen him, with my mind filled with faith,

source: །མ་ག་དྷཱ་ཡི་རི་བརྒྱུད་ནས།
en: “When I passed through the mountains of Magadha

source: །འོད་མའི་ཚལ་དུ་གནས་བྱས་ན། །དགེ་སློང་དགེ་འདུན་མཐོ་འཚམ་པའི།
en: And settled in the Bamboo Grove,

source: །ཉན་ཐོས་དག་ཅིག་དེར་ལྷགས་ཏེ། །གནས་མལ་དག་ནི་བསྐོས་ན་ཡང་།
en: Some disciples approached that place,

source: །དགེ་སློང་རྣམས་ལ་སྤྱོ་བྱེད་དེ།
en: Bringing harm to the community of monks. “Even in the distribution of bedding and seats,

source: །རྣམ་པར་འཚེ་ཞིང་སྨོད་པ་དང་། །ཡང་དང་ཡང་དུ་གཤེ་བར་བྱེད།
en: They scolded, Hurt, and reproached the monks And reviled them again and again.

source: །ཚངས་མཚུངས་སྤྱོད་པ་རྣམས་མཐོང་ནས།
en: “Seeing my fellow monks,

source: །བདག་ནི་སྙིང་རྗེ་བར་གྱུར་ཏེ།
en: I had compassion for them, thinking,

source: །བདག་ནི་ཟག་པ་ཟད་གྱུར་ཀྱང་།
en: ‘Even after I have exhausted my impurities

source: །ཉིད་ཀྱིས་དགེ་སློང་བསྙེན་བཀུར་བྱ།
en: I myself will serve monks.’

source: །བདག་གིས་བརྩོན་འགྲུས་བརྩམས་ནས་ནི།
en: “I began to exert myself.

source: །བསྟན་པ་འདི་ལ་བརྩོན་བྱས་པས།
en: And since I had exerted myself in this teaching,

source: །དགྲ་བཅོམ་བདག་གིས་ཐོབ་ནས་ནི།
en: I attained the state of an arhat

source: །མངོན་ཤེས་དྲུག་ལ་དབང་བྱས་སོ།
en: And became powerful in the six kinds of supernormal knowledge.

source: །ཐུབ་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ།
en: Bowed to the Muni,

source: །ཐལ་མོ་སྤྱི་བོར་སྦྱར་ནས་སུ།
en: Made the gesture of supplication above my head,

source: །སྐྱེས་བུ་དམ་པ་ལ་གསོལ་པ།
en: And said to the supreme man: “ ‘O Muni, please allow me To serve the monks,

source: །འདོད་ཆགས་གཏི་མུག་གིས་མ་ལགས།
en: Not out of desire or ignorance

source: །བྱམས་སེམས་གུས་དང་བཅས་པ་ཡིས། །ཐུབ་པ་བདག་ནི་དགེ་སློང་གི། །རིམ་གྲོ་བགྱིད་པར་གནང་བར་མཛོད།
en: But with thoughts of love and respect.’

source: །ཕ་རོལ་སེམས་ལ་མཁས་པ་ཡི།
en: “The Teacher, who was skillful in knowing others’ minds, Understood my offer

source: །སྟོན་པས་བདག་གསོལ་མཁྱེན་ནས་ནི།
en: And allowed me to perform true service

source: །ཉིད་ཀྱིས་དགེ་སློང་དགེ་འདུན་མདུན།
en: To the community of monks.

source: །གཉུག་མའི་རིམ་གྲོ་བྱེད་དུ་བཅུག །བྱམས་པའི་ལུས་ཀྱི་ལས་དང་ནི།
en: “By loving physical acts,

source: །དེ་བཞིན་ངག་དང་ཡིད་ཀྱིས་ཀྱང་།
en: And by verbal and mental acts as well,

source: །བདག་གིས་རྟག་ཏུ་སེམས་སྨད་ནས།
en: I always remained modest

source: །དགེ་སློང་དགེ་འདུན་རིམ་གྲོ་བྱས།
en: And served the community of monks.

source: །སྤྱོད་པ་ལ་ནི་ཞུགས་པ་དང་། །ལམ་ནས་འོངས་པའི་དགེ་སློང་དག །བདག་གིས་མཐོང་ནས་དགའ་བ་དང་། །སོ་སོར་ཡིད་ནི་བདེ་གྱུར་ནས།
en: “I was pleased to see monks Who were traveling or Who returned after traveling, And I was satisfied with each of them. “Displaying my magical power

source: །ཏིལ་མར་རབ་འབར་ལྟ་བུ་ཡི། །བདག་གི་སོར་ལྔའི་སྒྲོན་མ་ཡི། །རྫུ་འཕྲུལ་རྣམ་པར་བསྟན་བྱས་ནས།
en: By which my five fingers emitted light As if they were burning lamps,

source: །གནས་མལ་དག་ནི་འཆའ་བར་བྱེད།
en: I prepared bedding and seats.

source: །དགེ་སློང་གང་དག་བདག་གི་ནི། །ཆོ་འཕྲུལ་འདི་ནི་ལྟ་འདོད་ན།
en: “Those monks who wanted to see This miracle of mine

source: །ནམ་ནི་སྲོས་པར་གྱུར་པ་དང་། །མུན་ཁུང་བདག་དྲུང་ལྷགས་ནས་ནི།
en: Approached me in the dark When evening fell. “I prepared bedding and seats

source: །དེ་རྣམས་ལ་ནི་ཅི་རིགས་པར།
en: For them appropriately

source: །བྱམས་སེམས་གུས་དང་བཅས་པ་ཡིས། །གནས་མལ་དག་ནི་འཆའ་བྱེད་ཅིང་།
en: With thoughts of love and respect,

source: །སྐྱེ་བོ་མང་པོ་སྐྱོ་བ་སྐྱེད།
en: And many people were deeply moved.

source: །བདག་གིས་བསམས་པ་གང་ཡིན་དང་། །བདག་གིས་སྨོན་ལམ་གང་བཏབ་པ།
en: “What I had thought of And what I had made a wish for—

source: །བདག་གིས་བཟང་པོ་དེ་གྲུབ་ཅིང་།
en: Having completed those good deeds,

source: །དེ་ལྟ་བུར་ནི་གྱད་བུ་ནོར།
en: Thus the Elder Dravya Mallaputra,

source: །ཟག་པ་མེད་ཅིང་དབང་གྱུར་པས།
en: Who was untainted and powerful,

source: །གྱད་བུ་ནོར་གྱི་ལེའུ་སྟེ་ཉི་ཤུ་རྩ་བདུན་པའོ།། །།
en: Here ends the twenty-seventh section: The Section of Dravya Mallaputra. 8. Upasena

source: དེ་ནས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཉེ་སྡེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Thereupon the monks who were the most venerable of the elders requested the venerable Upasena, “O Venerable Upasena, the venerable Dravya Mallaputra has explained his karmic bond.

source: །ཚེ་དང་ལྡན་པ་ཉེ་སྡེ་ཚེ་དང་ལྡན་པ་གྱད་བུ་ནོར་གྱིས་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་ཟིན་གྱིས།
en: Now you, Venerable Upasena, should also explain your karmic bond.”

source: །ཚེ་དང་ལྡན་པ་ཉེ་སྡེས་ཀྱང་ད་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་ཅིག །དེ་ནས་ཚེ་དང་ལྡན་པ་ཉེ་སྡེས་དེའི་ཚེ་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་པར་བྱེད་དེ།
en: Then the venerable Upasena did explain his karmic bond:

source: །འདས་པ་དག་གི་དུས་ན་བདག །རྔོན་པ་དག་ཏུ་གྱུར་པ་ན།
en: “When I was a hunter In a past time,

source: །ནགས་ཆེན་ཉམས་དགའ་བྱུལ་བ་དང་། །རི་དགས་རྣམ་པ་སྣ་ཚོགས་མཐོང་།
en: I observed some animals When I was looking around in a vast, pleasant forest.

source: །དུག་གིས་བསྐུས་པའི་མདའ་རྣམས་དང་། །གཞུ་ཡི་ཚོགས་དག་བླངས་ནས་ནི།
en: “Carrying a bundle of arrows smeared with poison And a bow, I went

source: །རི་དགས་མང་པོའི་རི་ཡི་རྫོང་།
en: From one dangerous part of the mountain to another,

source: །དེ་ཡང་དེར་ནི་བདག་གིས་བརྒྱུས།
en: Which was abundant in animals.

source: །བདག་གིས་རི་དགས་རྣམས་མཐོང་ན།
en: “Whenever I saw an animal,

source: །གདུག་པའི་སེམས་ནི་ཉེར་བཞག་ནས།
en: I entertained malicious thoughts.

source: །དུག་གིས་བསྐུས་པའི་མདའ་རྣམས་ཀྱིས། །རི་དགས་མང་པོ་རབ་ཏུ་བསྣུན།
en: I shot many animals With arrows smeared with poison.

source: །བདག་གི་ལག་ན་གཞུ་དང་ནི། །དུག་གིས་བསྐུས་པའི་མདའ་སྲེལ་བཞིན།
en: “With that bow and Arrows smeared with poison in my hand,

source: །རང་སངས་རྒྱས་ཤིག་ལྗོན་ཤིང་གི། །དྲུང་ན་བཞུགས་པ་མཐོང་བར་གྱུར།
en: I saw a self-awakened one Sitting under a tree.

source: །བདག་གིས་དགེ་སྦྱོང་དེ་མཐོང་ནས།
en: “At the sight of the śramaṇa,

source: །དེ་ཚེ་ཡིད་ནི་མི་བདེར་གྱུར།
en: I experienced an unpleasant feeling.

source: །དེ་ནས་ཐུབ་པ་གནོད་མེད་པའི།
en: Then I shot an arrow at the body of the Muni,

source: །ལུས་ལ་མདས་ནི་བསྣུན་པར་གྱུར།
en: Who did not possess any malice.

source: །དེ་ཡི་འོག་ཏུ་དགེ་སློང་དེ།
en: “Thereupon the monk,

source: །མདའ་ཡི་ཟུག་རྔུའི་སྡུག་བསྔལ་ལྡན།
en: Suffering the pain caused by the arrow, Was emancipated without remainder

source: །ཤིང་དེ་ཉིད་ཀྱི་དྲུང་དུ་ནི། །ལེན་པ་མེད་པར་མྱ་ངན་འདས།
en: Under that very tree.

source: །རྩུབ་པའི་ལས་དེ་བྱས་པས་ན།
en: “Since I had performed that savage act,

source: །སེམས་ཅན་དམྱལ་བར་སྐྱེས་ནས་ནི།
en: I was born in the hells And experienced suffering there

source: །དེ་ལ་ལོ་ནི་སྟོང་ཕྲག་ཏུ། །བདག་གིས་སྡུག་བསྔལ་ཚོར་བ་མྱོང་།
en: For thousands of years.

source: །དེ་ནས་དམྱལ་ལས་ཤི་འཕོས་ནས།
en: “At a certain point I died in hell

source: །དུད་འགྲོའི་སྐྱེ་གནས་སོང་ནས་ནི།
en: And was reborn as an animal—

source: །རི་ཡི་རྫོང་ནི་དེ་ཉིད་དུ།
en: Born among those very animals

source: །བདག་ནི་རི་དགས་རྣམས་སུ་སྐྱེས།
en: In the dangerous parts of the mountain.

source: །རྟག་ཏུ་འཇིགས་ཤིང་བག་ཚ་ཞིང་།
en: “Always frightened, anxious,

source: །བཀྲེས་ཤིང་སྐོམ་པས་ཉེན་པས་ན།
en: Hungry, and tormented by thirst,

source: །རིད་ཅིང་ཤིན་ཏུ་སྡུག་བསྔལ་བས།
en: I was weary and suffering

source: །བདག་ནི་དེ་དང་དེར་རྒྱུའོ།
en: And wandered here and there.

source: །རྫོང་དེར་རྔོན་པ་གདུག་པ་ནི།
en: “In that dangerous place, malicious,

source: །ཤིན་ཏུ་མི་བཟད་པ་རྣམས་ཀྱིས།
en: Dreadful hunters

source: །དུག་གིས་བསྐུས་པའི་མདའ་རྣོན་གྱིས།
en: Shot sharp arrows smeared with poison

source: །བདག་གི་ལུས་ལ་བསྣུན་པར་གྱུར།
en: At my body.

source: །བདག་འགྱེལ་དེ་དག་གིས་མཐོང་ནས།
en: “Having seen me fall,

source: །བདག་ནི་གསོན་ཞིང་འགུལ་བཞིན་དུ།
en: While I was still alive and trembling

source: །མཚོན་གྱིས་ཡན་ལག་རྣམས་ཀྱི་ཤ།
en: They cut the flesh from my body with swords

source: །བཅད་ནས་དེ་རྣམས་ཁྱེར་ཞིང་འདོང་།
en: And carried it away.

source: །བདག་ནི་ས་ཕྱོགས་དེ་ཉིད་དུ།
en: “I was killed in that very place

source: །ཤ་ཡི་ཆེད་དུ་བསད་བྱས་ཏེ།
en: For the sake of my flesh. Thus, I experienced many such sufferings

source: །དེ་ལྟར་ཚེ་རབས་ལྔ་བརྒྱར་ནི། །སྡུག་བསྔལ་མང་པོ་བསྒྲུབས་པ་ཡིན།
en: For five hundred lives.

source: །རི་བོ་དེ་ཉིད་ངོས་ན་ནི།
en: “At the foot of the mountain I saw many ṛṣis

source: །དཀའ་ཐུབ་ལྡན་ལ་མཐུ་ཆེ་ཞིང་།
en: Engaged in ascetic practice, who possessed great power,

source: །རྫུ་འཕྲུལ་ཆེ་གཟི་མི་བཟད་པའི། །དྲང་སྲོང་རབ་ཏུ་མང་པོ་མཐོང་།
en: Great magical power, and fearful splendor.

source: །བདག་གིས་དྲང་སྲོང་དེ་མཐོང་ནས།
en: “When I saw the ṛṣis,

source: །དེ་ནས་བྱམས་པའི་སེམས་བསྒོམས་ཏེ།
en: I entertained a thought of love.

source: །བློ་བཟང་བྱམས་དང་ལྡན་པ་ལ།
en: I met them, endowed with goodwill and love,

source: །ཡང་དང་ཡང་དུ་བལྟ་བྱས་སོ། །དཀའ་ཐུབ་ལྡན་པ་དེ་རྣམས་ལ།
en: Again and again.

source: །བདག་གིས་གུས་བཅས་སེམས་དད་བྱས།
en: “I respectfully made my mind filled with faith In those ascetics.

source: །ཟས་དོན་གཉེར་བའི་སློང་བ་ནི། །རང་སངས་རྒྱས་ཤིག་མཐོང་ནས་ནི།
en: Begging for food,

source: །གུས་པ་ཡིས་ནི་རྟག་པར་དེ།
en: I always respectfully invited him

source: །བདག་གིས་ཟས་ལ་སྤྱན་དྲངས་སོ།
en: For a meal.

source: །བཙུན་པ་དེ་ཚིམ་བྱས་ནས་སུ།
en: “O honored ones, having satisfied him,

source: །དྲང་སྲོང་འདི་ལྟ་བུ་དག་དང་། །བདག་ནི་ལྷན་ཅིག་འགྲོགས་པར་ཤོག །རྫོགས་སངས་རྒྱས་ནི་མཉེས་བྱེད་ཅིང་།
en: ‘May I always be in the company Of ṛṣis equal to him. “ ‘Pleasing the Completely Awakened One,

source: །བདག་གིས་རབ་འབྱུང་ཐོབ་ནས་ནི།
en: May I succeed in going forth And dwell in the untainted state,

source: །འཇིགས་ཤིང་སྐྲག་པ་མེད་པ་ཡི།
en: Which is free from fear and dread.’

source: །ཟག་པ་མེད་ལ་གནས་པར་ཤོག །དགེ་བའི་ལས་དེ་བྱས་པས་ན།
en: “Since had I created this good karma,

source: །མི་ཉིད་རྙེད་པ་ཐོབ་ནས་ཀྱང་།
en: Once I attained a human birth,

source: །ཕྱུག་ཅིང་ནོར་ནི་མང་བར་གྱུར།
en: I became wealthy and possessed much property.

source: །བདག་གིས་ཤཱཀྱ་ཐུབ་མཐོང་ནས།
en: Having seen Śākyamuni,

source: །དད་པས་རབ་ཏུ་བྱུང་ནས་ཀྱང་།
en: “Having gone forth out of faith

source: །བསྟན་ལ་དགའ་བས་གནས་བྱས་པས།
en: And lived joyfully with the teachings,

source: །བདག་གིས་དགྲ་བཅོམ་ཐོབ་ནས་ནི།
en: I attained the state of an arhat

source: །ད་དུང་དུ་ཡང་བཙུན་པ་དག །བདག་ནི་ཐམས་ཅད་དབང་གྱུར་ནའང་།
en: “Still, O honored ones, Though I have brought all under control,

source: །ཕུག་གི་ནང་དུ་ཞུགས་ནས་སུ།
en: When I entered a cave

source: །འཆི་བ་ཉེ་བར་གྱུར་པ་ན།
en: And death approached me,

source: །སྦྲུལ་གདུག་ཤིན་ཏུ་མི་བཟད་པ།
en: A dreadful poisonous snake

source: །བདག་གི་ལུས་ལ་འབབ་པར་གྱུར།
en: Fell on my body.

source: །བཙུན་པ་བདག་གིས་ཉེས་སྤྱད་པ།
en: “O Honored Ones, this is the sin

source: །གང་བགྱིས་དྲན་པ་འདི་ལགས་ཏེ། །ལས་ནི་ཆུད་མི་ཟ་བས་ན།
en: That I remember committing.

source: །དེ་ལྟར་གནས་བརྟན་ཉེ་སྡེ་ཡིས།
en: Thus the Elder Upasena Explained his karma,

source: །ཉེ་སྡེའི་ལེའུ་སྟེ་ཉི་ཤུ་རྩ་བརྒྱད་པའོ།། །།
en: Here ends the twenty-eighth section: The Section of Upasena. 9. Bhadrika

source: དེ་ནས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱིས་ཚེ་དང་ལྡན་པ་བཟང་ལྡན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Thereupon the monks who were the most venerable of the elders requested the venerable Bhadrika, “O Venerable Bhadrika, the venerable Upasena has explained his karmic bond.

source: །ཚེ་དང་ལྡན་པ་བཟང་ལྡན་ཚེ་དང་ལྡན་པ་ཉེ་སྡེས་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་ཟིན་གྱིས།
en: Now you, Venerable Bhadrika, should also explain your karmic bond.”

source: ཚེ་དང་ལྡན་པ་བཟང་ལྡན་གྱིས་ཀྱང་ད་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་ཅིག །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱཀྱའི་རྒྱལ་པོ་བཟང་ལྡན་གྱིས་དེའི་ཚེ་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་པར་བྱེད་དེ།
en: Then the venerable Bhadrika did explain his karmic bond:

source: དགོན་པ་ཤིན་ཏུ་འཇིགས་ཆེན་གྱི། །མུ་གེ་དག་ནི་བྱུང་བ་ན།
en: “When a severe famine broke out,

source: །རང་གི་ཟས་ནི་དོན་གཉེར་བ།
en: Threatening the wilderness,

source: །སློང་བ་པོ་ནི་ལྔ་བརྒྱ་ཡི།
en: I was the head of five hundred beggars, Each seeking food.

source: །དེ་རྣམས་ཀུན་གྱི་དཔོན་གྱུར་ཅིང་། །དེ་དག་ཀུན་གྱིས་གཙོར་བཀུར་ཏེ།
en: “As the leader of them all,

source: །དེ་རྣམས་ཀུན་གྱིས་བསླངས་པ་ཡི།
en: I was served by all of them.

source: །ཟས་ནི་བདག་ལ་འབུལ་བར་བྱེད།
en: They offered me food That they had been given.

source: །དེ་དག་བཟང་ངམ་ངན་པའང་རུང་། །ཐོབ་པ་བདག་ལ་འགེད་པར་བྱེད།
en: “Whether good or bad, They brought me what they had obtained.

source: །བདག་གི་ཚིག་གིས་གནས་པས་ན།
en: They lived following my orders.

source: །དེ་དག་བདག་ལ་བརྙས་མི་བྱེད།
en: They never disrespected me.

source: །མི་ཞིག་སྣུམ་ཁུར་ཞིག་ཁྱེར་ནས།
en: “When a certain man carrying a pastry

source: །ཚོང་འདུས་ནང་ནས་འགྲོ་བ་ལས།
en: Passed through the market,

source: །བདག་གིས་དེ་ལས་མཐུས་ཕྲོགས་ཏེ།
en: I robbed him of it by force.

source: །ཁྱེར་ནས་དེ་ནས་སོང་བ་དང་། །དེ་ནས་བདག་གིས་བརྒྱུགས་པ་དང་། །ཕྱི་བཞིན་དུ་ནི་སྙེགས་མ་བྱུང་།
en: I grabbed it and fled. “I ran then, But there was no pursuer.

source: །སྨྱགས་བཅད་བྲོས་པར་གྱུར་པ་ན།
en: I succeeded in escaping with great fatigue.

source: །དེ་དག་གིས་ནི་གཟུང་མ་ནུས།
en: They were not able to catch me.

source: །འབབ་ཆུའི་ཕ་རོལ་རྒལ་ནས་ནི།
en: “After reaching the opposite bank of a river,

source: །བདག་ནི་ཕྱོགས་གཅིག་འདུག་ནས་སུ།
en: I sat down in a certain place.

source: །འགའ་ཞིག་འོང་བར་འགྱུར་སྙམ་ནས།
en: Afraid that somebody might come,

source: །མཐའ་དག་ཏུ་ནི་ལྟ་བར་བྱེད།
en: I looked all around. “When I had eaten some of the pastry,

source: །སྣུམ་ལ་གཡོས་ལེགས་བྱས་ཟིན་པའི།
en: Which was well cooked in oil,

source: །སྣུམ་ཁུར་བདག་གིས་ཟོས་ན་ནི།
en: My stomach was full

source: །དེས་ན་བདག་ནི་ལྟོ་འགྲངས་པས། །ཉིན་ཞག་གཅིག་ནི་ཐུབ་འགྱུར་སྙམ།
en: And I felt that I had eaten enough for a day.

source: །དེ་ནས་སྐལ་ལྡན་རང་སངས་རྒྱས།
en: “Just then there came a certain fortunate one, a self-awakened one,

source: །ཡང་སྲིད་སྐྱེ་བ་ཟད་གྱུར་པ།
en: Whose rebirths were exhausted,

source: །རྫུ་འཕྲུལ་ཆེ་གཟི་མི་བཟད་པ། །དྲང་སྲོང་འཇིགས་པ་ཞིག་འོངས་སོ།
en: A fearsome ṛṣi Possessing great magical power and awe-inspiring splendor.

source: །བདག་གི་སེམས་ལ་བསམས་པ་ནི།
en: “I thought to myself,

source: །སྡུག་བསྔལ་བཀྲེན་པར་གྱུར་པ་ནི།
en: ‘Suffering and poor,

source: །སྔོན་ཆད་བསོད་ནམས་མ་བྱས་པས། །དེས་བདག་འདི་ལྟར་བཀྲེན་པར་གྱུར།
en: I have not made merit before, Hence such poverty.

source: །སྣུམ་ཁུར་གཙང་མ་འདི་སྦྱིན་ཏེ།
en: This pure pastry to this śramaṇa

source: །བདག་ནི་ལྟོགས་པར་ཤི་བླ་ཡི།
en: And die from hunger,

source: །འདི་ལྟ་བཀྲེན་པ་མི་རུང་ངོ་།
en: Rather than being this poor.’

source: །དེ་ལ་བདག་སེམས་དད་བྱས་ནས།
en: “My mind was filled with faith in him,

source: །ཡིད་མགུ་བ་དང་རངས་པ་ཡིས།
en: And, with joy and delight,

source: །དགེ་སློང་དམ་པ་མཆོད་འོས་པའི།
en: I offered the pastry to that most excellent monk,

source: །ཡོན་གནས་དེ་ལ་སྣུམ་ཁུར་ཕུལ།
en: A field of merit who was worthy of veneration.

source: །སྐལ་ལྡན་གྱིས་ནི་དེ་བླངས་ནས།
en: “The fortunate one accepted it and,

source: །བདག་ཉིད་ལ་ནི་སྙིང་བརྩེའི་ཕྱིར།
en: Having compassion for me,

source: །དེ་ཉིད་དུ་ནི་ལོངས་སྤྱད་ནས།
en: Ate it right there

source: །དེ་ནས་མཁའ་ལ་འཕགས་པར་གྱུར།
en: And then soared up into the sky.

source: །བདག་ནི་བཀྲེན་པར་མི་འགྱུར་ཞིང་།
en: ‘May I not be poor

source: །ཁ་དོག་བཟང་པོ་རྣམས་དང་ནི།
en: But endowed with a beautiful appearance

source: །རིགས་བཙུན་པ་ཡང་དོན་དུ་གཉེར།
en: And a noble birth.

source: །གནས་བརྟན་འདི་ལྟ་བུ་དག་དང་། །བདག་ནི་ལྷན་ཅིག་འགྲོགས་པར་ཤོག །ཁྱོད་ཉིད་ཀྱིས་ནི་གང་རྟོགས་པ།
en: “ ‘May I always be in the company Of elders equal to you.

source: །དེ་འདྲའི་ཆོས་ཀྱང་ཤེས་པར་ཤོག །དགེ་བའི་ལས་དེ་བྱས་པས་ན།
en: May I realize such Dharma As you have understood!’ “Since I had created this good karma,

source: །ལྷ་དང་མི་ཡི་རྒྱལ་སྲིད་ཀྱང་། །བདག་གིས་མང་པོ་ཉམས་སུ་མྱོང་།
en: Divine and human kingship.

source: །ལས་དེ་ཡིས་ནི་ལན་འགའ་ཡང་།
en: Because of that karma,

source: །བདག་ནི་ངན་འགྲོར་མ་སོང་ངོ་།
en: I never went to inferior states of existence.

source: །ཤཱཀྱ་རྣམས་ཀྱི་གྲོང་མཆོག་ཏུ། །རིགས་བཙུན་པར་ནི་བདག་སྐྱེས་སོ།
en: In the capital city of the Śākyans.

source: །མིའི་སྲིད་ཐོབ་པ་འདི་ཡིན་ཏེ། །ཡང་དག་སངས་རྒྱས་བླ་མེད་པ།
en: This human life I have attained.

source: །ཤཱཀྱ་སེང་གེ་འདི་མཉེས་བྱས།
en: I have pleased this caravan leader, The Lion of the Śākyans.

source: །གང་ཚེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས།
en: “When the Buddha, the Blessed One,

source: །ཉེ་དུའི་གནས་སུ་གཤེགས་པ་ན།
en: Came to his family’s land,

source: །དེ་ཚེ་བདག་ནི་ཉེ་དུ་ཡི།
en: I then went forth,

source: །མདུན་དུ་བདར་ནས་རབ་ཏུ་བྱུང་།
en: Leading my relatives.

source: །བདག་གི་སྨོན་པ་གང་ཡིན་པ།
en: “What was my wish

source: །དེ་ནི་བདག་གིས་ཡོངས་རྫོགས་ཏེ། །མྱ་ངན་འདས་པ་བསིལ་གྱུར་པའི། །དགྲ་བཅོམ་པ་ཡང་བདག་གིས་ཐོབ།
en: Was perfectly accomplished by me. I attained nirvāṇa, The peaceful state of an arhat.” Thus Bhadrika, a relative of the Buddha,

source: །རྒྱལ་པོའི་རྒྱུད་ལས་རབ་བྱུང་བ།
en: Who had gone forth from the royal family,

source: །སངས་རྒྱས་ཉེ་དུ་བཟང་ལྡན་གྱིས།
en: Explained his karma

source: །ཤཱཀྱའི་རྒྱལ་པོ་བཟང་ལྡན་གྱི་ལེའུ་སྟེ་ཉི་ཤུ་རྩ་དགུ་པའོ།། །།
en: Here ends the twenty-ninth section: The Section of Bhadrika, the King of the Śākyans. 10. Lavaṇabhadrika

source: དེ་ནས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱིས་ཚེ་དང་ལྡན་པ་མཛེས་བཟང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་མཛེས་བཟང་ཚེ་དང་ལྡན་པ་ཤཱཀྱའི་རྒྱལ་པོ་བཟང་ལྡན་གྱིས་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་ཟིན་གྱིས།
en: Thereupon the monks who were the most venerable of the elders requested the venerable Lavaṇabhadrika, “O Venerable Lavaṇabhadrika, the venerable Bhadrika, king of the Śākyans, has explained his karmic bond.

source: ཚེ་དང་ལྡན་པ་མཛེས་བཟང་གིས་ཀྱང་ད་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་ཅིག །དེ་ནས་ཚེ་དང་ལྡན་པ་མཛེས་བཟང་གིས་དེའི་ཚེ་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་པར་བྱེད་དེ། སྐྱོབ་པ་ལོག་པར་དད་སེལ་གྱི།
en: Now you, Venerable Lavaṇabhadrika, should also explain your karmic bond.” Then the venerable Lavaṇabhadrika did explain his karmic bond:

source: །མཆོད་རྟེན་ཞིག་ནི་རྩིག་པ་ན།
en: “When a stūpa was being built For the protector Krakucchanda,

source: །དེ་ཚེ་བདག་ནི་མཁར་ལེན་པ།
en: I was a stonemason,

source: །གླ་མིར་གྱུར་ཏེ་དེ་ནས་ནི།
en: A laborer. At that time,

source: །བདག་གིས་མཆོད་རྟེན་རྩིག་པ་ལ།
en: “When building the stūpa,

source: །ཡང་དང་ཡང་དུ་དཔྱད་པ་ནི།
en: I remarked again and again,

source: །མཆོད་རྟེན་འདི་ནི་ཆེ་ཆེས་པས།
en: ‘This stūpa is very large.

source: །ནམ་ཞིག་ན་ནི་མཐར་ཕྱིན་འགྱུར།
en: When will it be finished?

source: །མཆོད་རྟེན་འདི་ནི་འཕང་དམའ་ཞིང་། །ཆུང་ངུ་ཞིག་ཏུ་བྱས་གྱུར་ན།
en: “ ‘If they made this stūpa lower And smaller,

source: །འགོད་པ་ཆུང་ཞིང་ཉོན་མོངས་མེད།
en: The construction would be easier and cause less trouble,

source: །མྱུར་དུ་མཐར་ཡང་ཕྱིན་པར་འགྱུར།
en: And it would soon be finished.’ “Because of my verbal misconduct

source: །ལས་ཀྱི་རྣམ་སྨིན་དེ་དང་ནི། །ངག་གི་ཉེས་པར་སྤྱད་པ་དེས།
en: And the maturation of that karma,

source: །དེ་ནས་འཆི་འཕོའི་དུས་བྱས་ཏེ།
en: After dying there,

source: །དམྱལ་བ་རྣམས་སུ་སྐྱེས་པར་གྱུར། །དམྱལ་བ་ནས་ནི་ཤི་འཕོས་བདག །གང་དང་གང་དུ་སྐྱེས་པར་ནི།
en: I was born in the hells. “After dying in hell, Wherever I was born,

source: །ཁ་དོག་ངན་ཅིང་བོང་ཆུང་ལ།
en: I was ugly and short

source: །བདག་ནི་ཡོངས་ཀྱིས་སྨད་པར་གྱུར།
en: And so was slandered by everyone.

source: །འོད་སྲུང་གི་ནི་གསུང་རབ་ཚེ།
en: “Once when Kāśyapa was preaching,

source: །སྔོན་ནི་ཁུ་བྱུག་ཕོར་གྱུར་ནས།
en: I was a cuckoo

source: །བཱ་རཱ་ཎ་སཱིའི་ལམ་གྱི་བར། །ཚལ་སྟུག་པོ་ཡི་ནང་ན་གནས།
en: Living in a dense forest located In the middle of the path to Vārāṇasī.

source: །དེ་ན་འཇིག་རྟེན་རབ་གསལ་མཛད།
en: “There, in the presence of the illuminator of the world

source: །དགེ་སློང་དགེ་འདུན་མདུན་བྱས་ལ།
en: And the community of monks,

source: །བདག་གིས་འཇམ་དབྱངས་སྐད་ཕྱུང་ཞིང་།
en: Singing in a gentle voice,

source: །ནམ་མཁའ་ལས་ནི་དེར་བསྐོར་ཏོ།
en: I circumambulated him in the air.

source: །ཇི་ཙམ་ཡང་དག་སངས་རྒྱས་ནི།
en: “When I saw the Completely Awakened One

source: །བསོད་སྙོམས་དོན་ཕྱིར་གཤེགས་མཐོང་ན།
en: Walking for the sake of alms,

source: །འབྱུང་བ་དང་ནི་གཤེགས་པ་ལ།
en: I departed, and continually

source: །རྟག་ཏུ་ཡང་ནི་བསྐོར་བ་བྱས།
en: Circumambulated him as he walked.

source: །རྫོགས་པའི་སངས་རྒྱས་བླ་མེད་པ།
en: The Supremely, Completely Awakened One.

source: །འཇམ་དབྱངས་རྣམས་ཀྱི་མཆོག་དང་ནི།
en: As the best of those who speak in a gentle voice,

source: །མང་དུ་ཐོས་དང་ཆོས་འཛིན་དང་། །དགེ་བའི་སྤོབས་པ་ཅན་དུ་བསྟན།
en: And for my having learned much, having understood the Dharma, And being endowed with eloquence. “The four groups of followers,

source: །ལྷ་འམ་ཡང་ན་མི་ཡང་རུང་། །འཁོར་བཞི་པོ་དག་བདག་ལས་ནི།
en: Whether gods or humans,

source: །སྙན་ཅིང་འཇེབས་པའི་ཆོས་ཐོས་ནས།
en: Will hear the sweet, pleasant-sounding Dharma

source: །ཐམས་ཅད་རབ་ཏུ་དགའ་བར་འགྱུར།
en: From me and all be delighted.

source: །དགེ་བ་ཉུང་ངུ་བྱས་པ་དང་། །མི་དགེ་མང་པོ་བྱས་པ་ཡི། །ལས་རྣམས་ཆུད་མི་ཟ་བས་ན།
en: “I performed a little good And much evil.

source: །དེ་ལྟར་གནས་བརྟན་མཛེས་བཟང་གིས།
en: Thus the Elder Lavaṇabhadrika Explained his karma,

source: །མཛེས་བཟང་གི་ལེའུ་སྟེ་སུམ་བཅུ་པའོ།། །།
en: Here ends the thirtieth section: The Section of Lavaṇabhadrika.

source: ལམ་ཕྲན་སྤྲུལ་ཁོལ་མ་འགགས་དང་། །ནག་པོ་ལྔ་པ་སྒྲ་ཅན་དང་། །དགའ་བོ་ནོར་དང་ཉེ་སྡེ་དང་། །བཟང་ལྡན་དང་ནི་མཛེས་བཟང་ངོ་།
en: Panthaka, Sarpadāsa, Aniruddha, Kāla, Rāhula as the fifth, Nanda, Dravya, Upasena, Bhadrika, and Lavaṇabhadrika. F. Verses of the Elders IV 1. Madhuvāsiṣṭha

source: །དེ་ནས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱིས་ཚེ་དང་ལྡན་པ་གནས་འཇོག་སྦྲང་རྩི་ཅན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་གནས་འཇོག་སྦྲང་རྩི་ཅན་ཚེ་དང་ལྡན་པ་མཛེས་བཟང་གིས་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་ཟིན་གྱིས།
en: Thereupon the monks who were the most venerable of the elders requested the venerable Madhuvāsiṣṭha, “O Venerable Madhuvāsiṣṭha, the venerable Lavaṇabhadrika has explained his karmic bond.

source: ཚེ་དང་ལྡན་པ་གནས་འཇོག་སྦྲང་རྩི་ཅན་གྱིས་ཀྱང་ད་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་ཅིག །དེ་ནས་ཚེ་དང་ལྡན་པ་གནས་འཇོག་སྦྲང་རྩི་ཅན་གྱིས་དེའི་ཚེ་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་པར་བྱེད་དེ།
en: Now you, Venerable Madhuvāsiṣṭha, should also explain your karmic bond.” Then the venerable Madhuvāsiṣṭha did explain his karmic bond:

source: བདག་ནི་སྔོན་ནི་ཡངས་པ་ཡི།
en: “Once when I was a great monkey,

source: །སྤྲ་ཆེན་སྤྲེའུ་དབང་གྱུར་པ་ན།
en: King of the monkeys, in Vaiśālī,

source: །ལྷུང་བཟེད་མང་པོ་མཐོང་ནས་ནི།
en: I saw many bowls

source: །རྒྱལ་བའི་ལྷུང་བཟེད་བླངས་པ་ལས།
en: And then took the Victor’s bowl.

source: །དགེ་སློང་རྣམས་ཀྱིས་བདག་བཀག་ནས། །དེ་ནས་བཅོམ་ལྡན་བཀའ་སྩལ་པ། །འདི་ནི་ལྷུང་བཟེད་མི་གཅོག་གིས།
en: “Monks stopped me, But then the Blessed One said,

source: །དགེ་སློང་རྣམས་ཀྱིས་མ་དགག་ཞིག །སྟོན་པའི་ལྷུང་བཟེད་ཁྱེར་ནས་ནི།
en: ‘Monks, you should not stop him, For he will not break the bowl.’ “Carrying the Teacher’s bowl,

source: །ཤིང་གི་ཁར་ནི་འཛེགས་ནས་སུ།
en: I climbed to the top of a tree,

source: །སྦྲང་རྩིས་ཡོངས་སུ་བཀང་ནས་ཀྱང་།
en: Filled it with honey,

source: །དལ་བུས་རིམ་གྱིས་བབས་ནས་ནི།
en: And then carefully descended.

source: །ལྷུང་བཟེད་སྦྲང་རྩི་ཅན་ཐོགས་ཏེ།
en: “When I held the bowl of honey

source: །སྟོན་པ་ལ་ནི་ཕུལ་བ་ལས། །སྟོན་པས་སྲོག་ཆགས་བཅས་པར་ནི།
en: And offered it to the Teacher,

source: །མཁྱེན་ཏེ་བདག་ལས་མ་བཞེས་ནས།
en: The Teacher did not accept it from me, Knowing that an insect was in it.

source: །བདག་གིས་ཕྱོགས་གཅིག་སོང་ནས་ནི།
en: “I went to one side

source: །དེ་ལ་སྲོག་ཆགས་ཡོད་མཐོང་ནས།
en: And saw there was an insect in it.

source: །སྲོག་ཆགས་མེད་པར་གཙང་བྱས་ཏེ།
en: I cleaned the insect from it

source: །སྟོན་པ་ལ་ནི་ཕུལ་བ་དང་། །འོན་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱིས་ནི།
en: And brought it to the Teacher. “But the Blessed One still

source: །བདག་ལས་སྦྲང་རྩི་མ་བཞེས་པར། །མ་བརྟགས་ཐུགས་སུ་ཆུད་ནས་ནི།
en: Did not accept the honey from me.

source: །བདེ་བར་གཤེགས་པས་མ་བཞེས་སྙམ།
en: I thought that the Sugata knew it was impure And so did not accept it.

source: །དེ་ནས་ལྷུང་བཟེད་སྦྲང་རྩི་ཅན། །དེ་ཚེ་བདག་གིས་ཆུས་བཏབ་ནས།
en: “Then I poured water Into the bowl of honey

source: །སེམས་ནི་མགུ་དང་དགའ་བ་ཡིས།
en: And, with delight and pleasure,

source: །རྫོགས་སངས་རྒྱས་ལ་ཕུལ་བ་ལས། །དེ་ནས་གང་ཟག་ཟླ་མེད་པ།
en: Offered it to the Completely Awakened One.

source: །སྟོན་པའི་ཕྱག་འཇམ་གཉིས་ཀྱིས་སུ།
en: “The tender hands Of the matchless man, the Teacher,

source: །བདག་ལ་ལྷུང་བཟེད་བཞེས་ནས་ནི།
en: Then received the bowl from me

source: །དེ་ནི་ཉན་ཐོས་རྣམས་ལ་གཏད།
en: And gave it to his disciples.

source: །དེ་ནས་ཆོས་རྒྱལ་སྤྱན་སྔ་ནས། །གར་བྱེད་ཅིང་ནི་དེ་ནས་སོང་།
en: Thereupon, dancing, I departed From the presence of the Dharma King.

source: །མི་ཉིད་དག་ནི་ཐོབ་ནས་སུ།
en: ‘May I, having attained a human life,
